# pandas: Data frame & series
combination of series(column vector) is called data frame

In [4]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [5]:
import pandas as pd

In [6]:
import numpy as np

In [7]:
a = [[1,2],[3,4]]

In [9]:
np.array(a)

array([[1, 2],
       [3, 4]])

In [10]:
pd.DataFrame(a)

   0  1
0  1  2
1  3  4

In [24]:
df = pd.DataFrame([{"math": 1, "science": 2}, {"math": 3, "science": 4}]*100)
df

     math  science
0       1        2
1       3        4
2       1        2
3       3        4
4       1        2
..    ...      ...
195     3        4
196     1        2
197     3        4
198     1        2
199     3        4

[200 rows x 2 columns]

In [21]:
df["math"]

0    1
1    3
Name: math, dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   math     2 non-null      int64
 1   science  2 non-null      int64
dtypes: int64(2)
memory usage: 160.0 bytes

In [23]:
df.head(1)

   math  science
0     1        2

In [25]:
df.head() #show first 5 row

   math  science
0     1        2
1     3        4
2     1        2
3     3        4
4     1        2

In [26]:
df.tail()     #show last 5 row

     math  science
195     3        4
196     1        2
197     3        4
198     1        2
199     3        4

# pandas: dataformats

sql,csv,excel,json,pickle etc.............